{
  "desserts": [
    {
      "id": 1,
      "title": "Chocolate Cake",
      "ingredients": {
        "1": "Butter and flour for coating and dusting the cake pan",
        "2": "3 cups all-purpose flour",
        "3": "3 cups granulated sugar",
        "4": "1 1/2 cups unsweetened cocoa powder",
        "5": "1 tablespoon baking soda",
        "6": "1 1/2 teaspoons baking powder",
        "7": "1 1/2 teaspoons salt",
        "8": "4 large eggs",
        "9": "1 1/2 cups buttermilk",
        "10": "1 1/2 cups warm water",
        "11": "1/2 cup vegetable oil",
        "12": "2 teaspoons vanilla extract "
      },
      "instructions": {
        "1": "Preheat oven to 350 degrees Fahrenheit. Butter three 9-inch cake rounds. Dust with flour and tap out the excess.",
        "2": "Mix together flour, sugar, cocoa, baking soda, baking powder, and salt in a stand mixer using a low speed until combined.",
        "3": "Add eggs, buttermilk, warm water, oil, and vanilla. Beat on a medium speed until smooth. This should take just a couple of minutes.",
        "4": "Divide batter among the three pans. I found that it took just over 3 cups of the batter to divide it evenly.",
        "5": "Bake for 30-35 minutes in a 350 degree oven until a toothpick inserted into the center comes out clean.",
        "6": "Cool on wire racks for 15 minutes and then turn out the cakes onto the racks and allow to cool completely.",
        "7": "Frost with your favorite frosting and enjoy!"
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235285/cakery/small_chocolate_cake_22acc785ee.webp",
      "category": "Cake",
      "time": "45min",
      "servings": 16
    },
    {
      "id": 2,
      "title": "White Cake",
      "ingredients": {
        "1": "1 cup white sugar",
        "2": "½ cup unsalted butter",
        "3": "2 large eggs",
        "4": "2 teaspoons vanilla extract",
        "5": "1 ½ cups all-purpose flour",
        "6": "1 ¾ teaspoons baking powder",
        "7": "½ cup milk"
      },
      "instructions": {
        "1": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch square cake pan.",
        "2": "Cream sugar and butter together in a mixing bowl. Add eggs, one at a time, beating briefly after each addition. Stir in vanilla.",
        "3": "Combine flour and baking powder in a separate bowl. Add to the wet ingredients and mix well. Add milk and stir until smooth. Pour batter into the prepared cake pan.",
        "4": "Bake in the preheated oven until the top springs back when lightly touched, 30 to 40 minutes."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235286/cakery/small_white_cake_bc8b402e79.webp",
      "category": "Cake",
      "time": "40min",
      "servings": 12
    },
    {
      "id": 3,
      "title": "Lemon layer cake",
      "ingredients": {
        "1": "225g unsalted butter, softened",
        "2": "225g caster sugar",
        "3": "4 large eggs",
        "4": "225g self-raising flour",
        "5": "1 tsp baking powder",
        "6": "75g natural yogurt",
        "7": "1 tsp vanilla bean paste or extract",
        "8": "3 lemons, zested",
        "9": "150g granulated sugar",
        "10": "3 lemons, zest of 2 pared into strips, juiced (you’ll need 60ml)",
        "11": "150g unsalted butter, softened",
        "12": "150g icing sugar, sieved",
        "13": "1 tsp vanilla bean paste or extract",
        "14": "300g full-fat soft cheese"
      },
      "instructions": {
        "1": "Heat the oven to 180C/160C fan/gas 4 and line the base of two 20cm sandwich tins with baking parchment. Beat the butter and sugar together for 3 mins using an electric whisk until smooth and fluffy. Add the eggs, one at a time, beating well between each addition and scraping down the sides of the bowl. Fold in the flour and baking powder until well incorporated, then fold in the yogurt, vanilla and lemon zest. Divide between the tins and bake for 30-35 mins until golden and a skewer inserted into the middles comes out clean.",
        "2": "Meanwhile, make the drizzle. Tip the sugar, lemon juice and 100ml water into a small pan set over a medium heat and stir until dissolved. Add the lemon zest, bring to the boil and simmer for 2-3 mins until the zest has softened and the liquid is syrupy. Remove the zest to a sheet of baking parchment using a slotted spoon, and remove the syrup from the heat.",
        "3": "Leave the sponges to cool for 10 mins in the tins, then pour over the warm drizzle. Leave to cool completely.",
        "4": "For the icing, beat the butter and icing sugar together using an electric whisk for 4-5 mins until smooth, scraping down the sides of the bowl as you go. Add the vanilla and soft cheese and beat for 4 mins more until thick and creamy. Don’t worry if it doesn’t look thick at first it will loosen, then thicken again as you beat it.",
        "5": "Remove the cooled sponges from the tins. Spoon the icing into a piping bag fitted with a star nozzle. Put one sponge on a cake stand or serving plate, and pipe just under half the icing around the edge using a circular motion for a wavy effect. Pipe a little more icing over the empty middle (this doesn’t need to be neat) and smooth with the back of a spoon. Chill for 45 mins-1 hr until set. Top with the second sponge, then pipe eight blobs of icing around the edge at regular intervals, leaving a gap between each. Spoon the candied lemon zest into each gap, then serve."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235287/cakery/lemon_cake_8761e69c19.webp",
      "category": "Cake",
      "time": "2hrs 25min",
      "servings": 8
    },
    {
      "id": 4,
      "title": "Lemon Blueberry Zucchini Cake",
      "ingredients": {
        "1": "2 cups finely shredded and lightly drained zucchini",
        "2": "3 large eggs, lightly beaten, room temperature",
        "3": "1 cup (224g) vegetable oil",
        "4": "3 teaspoons vanilla extract",
        "5": "2¼ cups (450g) granulated sugar",
        "6": "3 cups (375g) all-purpose flour",
        "7": "1 teaspoon kosher salt",
        "8": "1 teaspoon baking powder",
        "9": "¼ teaspoon baking soda",
        "10": "1 pint fresh blueberries, you can reserve a few for garnish if so desired",
        "11": "1 cup (226g) butter, room temperature",
        "12": "3½ cups confectioners' sugar",
        "13": "juice of one lemon",
        "14": "zest of one lemon",
        "15": "1 teaspoon vanilla extract",
        "16": "⅛ teaspoon kosher salt"
      },
      "instructions": {
        "1": "Preheat oven to 350°F. Prepare two 8-inch round cake pans with butter and flour or use non-stick baking spray.",
        "2": "Grate a large zucchini (or two small zucchini) and place in a clean dish towel. Life the edges of the towel up and squeeze some of the extra moisture out, but you do not want the zucchini to be dry. You will want 2 total cups of shredded zucchini after it has been drained. Set aside.",
        "3": "In a large bowl and using a hand mixer, beat together the eggs, oil, vanilla, and sugar. Fold in the zucchini.",
        "4": "Slowly stir in the flour, salt, baking powder, and baking soda. Gently fold in the blueberries. Divide batter evenly between prepared cake pans.",
        "5": "Bake 35-40 minutes in the preheated oven, or until a knife inserted in the center of a cake comes out clean. Cool 20 minutes in pans, then turn out onto wire racks to cool completely.",
        "6": "Combine butter, sugar and salt and beat till well combined.",
        "7": "Add lemon juice and vanilla and continue to beat for another 3 to 5 minute or until creamy.",
        "8": "Fold in zest (If you are piping this buttercream, I recommend leaving out the zest)."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235274/cakery/zucchini_cake_5c945e6c36.webp",
      "category": "Cake",
      "time": "55min",
      "servings": 8
    },
    {
      "id": 5,
      "title": "Vanilla cupcakes",
      "ingredients": {
        "1": "110g softened butter",
        "2": "110g golden caster sugar",
        "3": "2 eggs",
        "4": "1 tsp vanilla extract",
        "5": "110g self-raising flour",
        "6": "1-2 tbsp milk , plus a little extra for the icing",
        "7": "125g butter , softened",
        "8": "185g icing sugar"
      },
      "instructions": {
        "1": "Heat oven to 180C/160C fan/gas 4. Line 12 holes in a shallow muffin tin with cupcake cases (not muffin cases). Cream the butter and sugar together until the mixture is light and fluffy. Beat the eggs and vanilla in a jug, then beat into the butter mixture a little at a time.",
        "2": "Fold the flour into the mixture along with a little milk – the mixture should fall easily off a spoon. Divide the mixture between the cases, filling each one no more than half full.",
        "3": "Cook the cakes for 12-15 mins they should be firm to the touch and slightly golden brown. Cool in the tin for 5 mins, then lift them out gently and leave to cool completely.",
        "4": "To make the icing, beat the butter until it is very soft. Beat in the icing sugar a little at a time, then beat in a splash of the milk as you need to give you a soft icing that can be piped easily. Scrape the icing into an icing bag fitted with a star nozzle. Ice the cakes in swirls, starting in the centre and working outwards."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235294/cakery/small_vanilla_cupcake_f849921f1f.webp",
      "category": "Cupcakes",
      "time": "1hr",
      "servings": 12
    },
    {
      "id": 6,
      "title": "Chocolate Cupcakes",
      "ingredients": {
        "1": "3/4 cup (94g) all-purpose flour",
        "2": "1/2 cup (41g) unsweetened natural cocoa powder",
        "3": "3/4 teaspoon baking powder",
        "4": "1/2 teaspoon baking soda",
        "5": "1/4 teaspoon salt",
        "6": "2 large eggs, at room temperature*",
        "7": "1/2 cup (100g) granulated sugar",
        "8": "1/2 cup (100g) packed light brown sugar",
        "9": "1/3 cup (80ml) vegetable or canola oil (or melted coconut oil)",
        "10": "2 teaspoons pure vanilla extract",
        "11": "1/2 cup (120ml) buttermilk, at room temperature"
      },
      "instructions": {
        "1": "Preheat the oven to 350°F (177°C). Line a 12-cup muffin pan with cupcake liners. Line a second pan with 2 liners – this recipe makes about 14 cupcakes. Set aside.",
        "2": "Cupcakes: Whisk the flour, cocoa powder, baking powder, baking soda, and salt together in a large bowl until thoroughly combined. Set aside. In a medium bowl, whisk the eggs, granulated sugar, brown sugar, oil, and vanilla together until combined. Pour half of the wet ingredients into the dry ingredients. Then half of the buttermilk. Gently whisk for a few seconds. Repeat with the remaining wet ingredients and buttermilk. Stir until combined do not overmix. The batter will be thin.",
        "3": "Pour or spoon the batter into the liners. Fill only halfway (this is imperative! only halfway!) to avoid spilling over the sides or sinking.",
        "4": "Bake for 18-21 minutes, or until a toothpick inserted in the center comes out clean. Allow to cool completely before frosting.",
        "5": "Frost cooled cupcakes however you like. Top with sprinkles, if desired. Store leftovers in the refrigerator for up to 5 days."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235286/cakery/small_Chocolate_Cupcakes_80619f16ef.webp",
      "category": "Cupcakes",
      "time": "3hrs 25min",
      "servings": 12
    },
    {
      "id": 7,
      "title": "Strawberry Cupcakes",
      "ingredients": {
        "1": "175g self-raising flour",
        "2": "115g caster sugar",
        "3": "2 eggs",
        "4": "100g Greek yogurt",
        "5": "115g butter, melted and cooled slightly",
        "6": "100g strawberries, hulled and finely chopped",
        "7": "300g icing sugar, sifted",
        "8": "150g butter, softened",
        "9": "2tbsp milk",
        "10": "1tsp vanilla extract",
        "11": "pink food colouring",
        "12": "6 strawberries, halved, or 12 small whole strawberries"
      },
      "instructions": {
        "1": "Heat the oven to 180C/160C fan/gas 4 and line a 12-hole muffin tin with cupcake cases. Mix the flour and sugar together in a large bowl. In a large jug, whisk together the eggs, yogurt and melted butter. Gradually mix the wet ingredients into the dry until you have a smooth batter, then fold in the strawberries.",
        "2": "Fill the prepared cases so they are about three-fourths full. Bake for 25-30 mins, or until golden and a skewer inserted into the middles comes out clean. Leave to cool.",
        "3": "Meanwhile, make the icing. Beat the sugar and butter together until smooth and pale, then add the milk, vanilla and a little pink food colouring and beat until the icing is an even pale pink shade. Spoon the icing into a piping bag fitted with a star nozzle, then pipe in swirls onto the cooled cupcakes. Decorate each with a strawberry half or small strawberry, then serve."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235293/cakery/small_strawberry_cupcakes_81fcd5b9ac.webp",
      "category": "Cupcakes",
      "time": "50min",
      "servings": 12
    },
    {
      "id": 8,
      "title": "Oreo Cupcakes",
      "ingredients": {
        "1": "400g Plain Flour",
        "2": "80g Cocoa Powder",
        "3": "560g Caster Sugar",
        "4": "6 tsp Baking Powder",
        "5": "Pinch of Salt",
        "6": "160g Unsalted Butter",
        "7": "480ml Whole Milk",
        "8": "4 Egg",
        "9": "1 tsp Vanilla Extract",
        "10": "20 Oreo Biscuits",
        "11": "14 Muffin Cases",
        "12": "100g Unsalted Butter",
        "13": "160g Cream Cheese",
        "14": "350g Icing Sugar"
      },
      "instructions": {
        "1": "Preheat the oven to 170C/160 fan. Line a muffin tray with paper muffin cases. twist 12 Oreos to separate them, and place half in each case, with the cream facing upwards.Put the flour, sugar, cocoa powder, baking powder, salt and butter in a large bowl and mix until you get a sandy consistency and everything is combined.",
        "2": "Whisk the milk, eggs, and vanilla extract together in a separate jug, then slowly add half into the flour mixture, and beat well to get rid of any lumps. Gradually add the rest of the milk mixture whilst mixing until smooth.",
        "3": "Add the mixture to the paper cases, making sure they are equally full (about two-thirds). Bake the cakes in the oven for 20-25 minutes.",
        "4": "Whilst the cakes are cooking, smash up 6 Oreos in a bag and set aside. Whisk the butter, cream cheese and icing sugar until light and fluffy. Then, gently fold in the Oreo Crumbs.",
        "5": "When the cakes have cooled, pipe the icing onto the cakes and use any left over Oreos to decorate."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235292/cakery/small_oreo_cupcakes_b27150b562.webp",
      "category": "Cupcakes",
      "time": "35min",
      "servings": 12
    },
    {
      "id": 9,
      "title": "Chocolate Chip Cookies",
      "ingredients": {
        "1": "½ cup granulated sugar (100 g)",
        "2": "¾ cup brown sugar (165 g), packed",
        "3": "1 teaspoon salt",
        "4": "½ cup unsalted butter (115 g), melted",
        "5": "1 egg",
        "6": "1 teaspoon vanilla extract",
        "7": "1 ¼ cups all-purpose flour (155 g)",
        "8": "½ teaspoon baking soda",
        "9": "4 oz milk or semi-sweet chocolate chunks (110 g)",
        "10": "4 oz dark chocolate chunk (110 g), or your preference"
      },
      "instructions": {
        "1": "In a large bowl, whisk together the sugars, salt, and butter until a paste forms with no lumps.",
        "2": "Whisk in the egg and vanilla, beating until light ribbons fall off the whisk and remain for a short while before falling back into the mixture.",
        "3": "Sift in the flour and baking soda, then fold the mixture with a spatula (Be careful not to overmix, which would cause the gluten in the flour to toughen resulting in cakier cookies).",
        "4": "Fold in the chocolate chunks, then chill the dough for at least 30 minutes. For a more intense toffee-like flavor and deeper color, chill the dough overnight. The longer the dough rests, the more complex its flavor will be.",
        "5": "Preheat oven to 350°F (180°C). Line a baking sheet with parchment paper.",
        "6": "Scoop the dough with an ice-cream scoop onto a parchment paper-lined baking sheet, leaving at least 4 inches (10 cm) of space between cookies and 2 inches (5 cm) of space from the edges of the pan so that the cookies can spread evenly.",
        "7": "Bake for 12-15 minutes, or until the edges have started to barely brown.",
        "8": "Cool completely before serving."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235285/cakery/small_chocolate_chip_coookies_9fb5d794d7.webp",
      "category": "Cookies",
      "time": "1hrs 5min",
      "servings": 12
    },
    {
      "id": 10,
      "title": "Ginger Cookies",
      "ingredients": {
        "1": "2 ¼ cups all-purpose flour",
        "2": "2 teaspoons ground ginger",
        "3": "1 teaspoon baking soda",
        "4": "¾ teaspoon ground cinnamon",
        "5": "½ teaspoon ground cloves",
        "6": "¼ teaspoon salt",
        "7": "¾ cup margarine, softened",
        "8": "1 cup white sugar",
        "9": "1 egg",
        "10": "1 tablespoon water",
        "11": "¼ cup molasses",
        "12": "2 tablespoons white sugar"
      },
      "instructions": {
        "1": "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour, ginger, baking soda, cinnamon, cloves, and salt. Set aside.",
        "2": "In a large bowl, cream together the margarine and 1 cup sugar until light and fluffy. Beat in the egg, then stir in the water and molasses. Gradually stir the sifted ingredients into the molasses mixture. Shape dough into walnut sized balls, and roll them in the remaining 2 tablespoons of sugar. Place the cookies 2 inches apart onto an ungreased cookie sheet, and flatten slightly.",
        "3": "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Store in an airtight container."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235286/cakery/ginger_cookies_caa30451ae.webp",
      "category": "Cookies",
      "time": "50min",
      "servings": 24
    },
    {
      "id": 11,
      "title": "Oaty hazelnut cookies",
      "ingredients": {
        "1": "50g butter plus a little for greasing",
        "2": "2 tbsp maple syrup",
        "3": "1 dessert apple , unpeeled and coarsely grated (you need 85g)",
        "4": "1 tsp cinnamon",
        "5": "50g raisins",
        "6": "50g porridge oats",
        "7": "50g spelt flour",
        "8": "40g unblanched hazelnuts , cut into chunky slices",
        "9": "1 egg"
      },
      "instructions": {
        "1": "Heat oven to 180C/160C fan/gas 4 and lightly grease a non-stick baking tray (or line a normal baking tray with baking parchment). Tip the butter and syrup into a small non-stick pan and melt together, then add the apple and cook, stirring, over a medium heat until it softens, about 6-7 mins. Stir in the cinnamon and raisins.",
        "2": "Mix the oats, spelt flour, and hazelnuts in a bowl, pour in the apple mixture, then add the egg and beat everything together really well.",
        "3": "Spoon onto the baking tray, well spaced apart to make 9 mounds, then gently press into discs. Bake for 18-20 mins until golden, then cool on a wire rack."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235290/cakery/medium_hazelnut_cookies_bfe7c5f905.webp",
      "category": "Cookies",
      "time": "45min",
      "servings": 9
    },
    {
      "id": 12,
      "title": "Vegan chocolate chip cookies",
      "ingredients": {
        "1": "1/2 cup coconut oil, solid but scoop-able",
        "2": "1 and 1/4 cups light brown sugar, packed",
        "3": "2 teaspoons vanilla extract",
        "4": "1/4 cup coconut milk",
        "5": "1/4 cup unsweetened applesauce",
        "6": "2 and 1/3 cups all-purpose flour",
        "7": "1 teaspoon baking soda",
        "8": "1/2 teaspoon salt",
        "9": "2 cups chocolate chips (use vegan chocolate chips if vegan), divided"
      },
      "instructions": {
        "1": "Preheat oven to 375 degrees. Line a large baking sheet with parchment paper; set aside.",
        "2": "In a large bowl whisk together the coconut oil, brown sugar, and vanilla, beating until well combined. Add in the coconut milk and applesauce and whisk until well combined; set aside. In a separate bowl combine the flour, baking soda, and salt; whisk well to combine.",
        "3": "Add the dry ingredients into the wet mixture and, using a wooden spoon or very sturdy spatula, stir until ingredients are combined. The batter will be very thick! Fold in 1 and 3/4 cups of the chocolate chips.",
        "4": "Scoop three tablespoon sized mounds of dough onto the prepared cookie sheet, leaving a few inches between each cookies for spreading. Bake for 9 to 10 minutes, or until the edges are golden and the centers have set. Press remaining chocolate chips on top of warm cookies, and sprinkle with sea salt, if using. Cool cookies on the baking sheet for 15 minutes before transferring them to a cooling rack."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235292/cakery/Vegan_Chocolate_Chip_Cookies_dd708ce3e0.webp",
      "category": "Cookies",
      "time": "35min",
      "servings": 16
    },
    {
      "id": 13,
      "title": "Glazed donuts",
      "ingredients": {
        "1": "1 cup (240ml) whole milk, warmed to about 110°F (43°C)*",
        "2": "1 Tablespoon active dry yeast",
        "3": "1/3 cup (65g) granulated sugar",
        "4": "2 large eggs",
        "5": "6 Tablespoons (86g) unsalted butter, melted and slightly cooled",
        "6": "1 teaspoon pure vanilla extract",
        "7": "1/4 teaspoon ground nutmeg",
        "8": "1/2 teaspoon salt",
        "9": "4 cups (500g) all-purpose flour (spoon & leveled), plus more as needed",
        "10": "1 - 2 quarts vegetable oil",
        "11": "2 cups (240g) confectioners sugar, sifted",
        "12": "1/3 cup (80ml) heavy cream or whole milk",
        "13": "1/2 teaspoon pure vanilla extract"
      },
      "instructions": {
        "1": "Prepare the dough: Whisk the warm milk, yeast, and sugar together in the bowl of your stand mixer fitted with a dough hook or paddle attachment. Cover and allow to sit for 5 minutes. The mixture should be a little frothy on top after 5 minutes. If not, start over with new yeast.",
        "2": "Add the eggs, butter, vanilla, nutmeg, salt, and 2 cups (245g) flour. Beat on low speed for 1 minute. Scrape down the sides of the bowl with a rubber spatula as needed. Add remaining flour and beat on medium speed until the dough comes together and pulls away from the sides of the bowl, about 2 minutes. If needed, add more flour, 1 Tablespoon at a time, until the dough pulls away from the sides of the bowl. Don’t add too much flour, though. You want a slightly sticky dough.",
        "3": "Knead the dough: Keep the dough in the mixer and beat for an additional 2 minutes or knead by hand on a lightly floured surface for 2 minutes.",
        "4": "Let Dough Rise: Lightly grease a large bowl with oil or nonstick spray. Place the dough in the bowl, turning it to coat all sides in the oil. Cover the bowl with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the dough to rise in a relatively warm environment for 1.5-2 hours or until double in size.",
        "5": "Shape Doughnuts: When the dough is ready, punch it down to release the air.Remove dough from the bowl and turn it out onto a lightly floured surface. If needed, punch down again to release any more air bubbles. Using a rolling pin, roll the dough out until it is 1/2 inch thick. Using a 3-3.5 inch doughnut cutter, cut into 12 doughnuts. If you can’t quite fit 12, re-roll the scraps and cut more.",
        "6": "Line 1 or 2 baking sheets with parchment paper or silicone baking mats. Place doughnuts and doughnut holes on each. Loosely cover and allow to rest as you heat the oil. They will rise a bit as they rest. Place a cooling rack over another baking sheet.",
        "7": "Pour oil into a large heavy-duty pot set over medium heat. Heat oil to 375°F (191°C). Add 2-3 doughnuts at a time and cook for 1 minute on each side. Carefully remove with a metal spatula or metal slotted spoon. Wear kitchen gloves if oil is splashing. Place fried doughnuts onto prepared rack. Repeat with remaining doughnuts, then turn off heat.",
        "8": "Make the glaze: Whisk all of the glaze ingredients together. Dip each warm doughnut (don’t wait for them to cool!) into the glaze, making sure to coat both sides. Place back onto prepared rack as excess glaze drips down. After about 20 minutes, the glaze will set + harden.",
        "9": "Doughnuts are best enjoyed the same day. You can store in an airtight container at room temperature or in the refrigerator for 1-2 extra days."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235288/cakery/small_crispy_donuts_551bda4bae.webp",
      "category": "Donuts",
      "time": "2hrs",
      "servings": 12
    },
    {
      "id": 14,
      "title": "Crispy and Creamy Doughnuts",
      "ingredients": {
        "1": "2 (.25 ounce) envelopes active dry yeast",
        "2": "¼ cup warm water (105 to 115 degrees)",
        "3": "1 ½ cups lukewarm milk",
        "4": "1 teaspoon salt",
        "5": "½ cup white sugar",
        "6": "2 eggs",
        "7": "⅓ cup shortening",
        "8": "5 cups all-purpose flour",
        "9": "1 quart vegetable oil for frying",
        "10": "⅓ cup butter",
        "11": "2 cups confectioners' sugar",
        "12": "1 ½ teaspoons vanilla",
        "13": "4 tablespoons hot water or as needed"
      },
      "instructions": {
        "1": "Sprinkle the yeast over the warm water, and let stand for 5 minutes, or until foamy.",
        "2": "In a large bowl, whisk together the flour, cocoa powder, baking soda, and salt.In a large bowl, mix together the yeast mixture, milk, sugar, salt, eggs, shortening, and 2 cups of the flour. Mix for a few minutes at low speed, or stirring with a wooden spoon. Beat in remaining flour 1/2 cup at a time, until the dough no longer sticks to the bowl. Knead for about 5 minutes, or until smooth and elastic. Place the dough into a greased bowl, and cover. Set in a warm place to rise until double. Dough is ready if you touch it, and the indention remains.",
        "3": "Turn the dough out onto a floured surface, and gently roll out to 1/2 inch thickness. Cut with a floured doughnut cutter. Let doughnuts sit out to rise again until double. Cover loosely with a cloth.",
        "4": "Melt butter in a saucepan over medium heat. Stir in confectioners' sugar and vanilla until smooth. Remove from heat, and stir in hot water one tablespoon at a time until the icing is somewhat thin, but not watery. Set aside.",
        "5": "Heat oil in a deep-fryer or large heavy skillet to 350 degrees F (175 degrees C). Slide doughnuts into the hot oil using a wide spatula. Turn doughnuts over as they rise to the surface. Fry doughnuts on each side until golden brown. Remove from hot oil, to drain on a wire rack. Dip doughnuts into the glaze while still hot, and set onto wire racks to drain off excess. Keep a cookie sheet or tray under racks for easier clean up."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235286/cakery/crispy_donuts_551bda4bae.webp",
      "category": "Donuts",
      "time": "2hrs 40min",
      "servings": 18
    },
    {
      "id": 15,
      "title": "Baked Chocolate Donuts",
      "ingredients": {
        "1": "1 cup (125 grams) all-purpose flour",
        "2": "1/4 cup (22 grams) unsweetened cocoa powder",
        "3": "1/2 teaspoon baking soda",
        "4": "1/8 teaspoon salt",
        "5": "1/2 cup (120 ml) buttermilk",
        "6": "1/2 cup (100 grams) granulated sugar",
        "7": "1 large egg",
        "8": "2 tablespoons (30 grams) butter",
        "9": "1 teaspoon vanilla extract",
        "10": "1 cup (120 grams) powdered sugar",
        "11": "3 tablespoons (17 grams) unsweetened cocoa powder",
        "12": "1/2 teaspoon vanilla extract",
        "13": "3-4 tablespoons (45 to 60 ml) milk"
      },
      "instructions": {
        "1": "Preheat the oven to 350°F. Spray a donut pan well with non-stick cooking spray and set aside.",
        "2": "In a large bowl, whisk together the flour, cocoa powder, baking soda, and salt.",
        "3": "In a separate bowl, mix together the buttermilk, sugar, egg, butter, and vanilla until well combined.",
        "4": "Add the wet ingredients to the dry ingredients and mix until just combined.",
        "5": "Spoon the batter into the donut cavities making sure to only fill them about 2/3 - 3/4 of the way full.",
        "6": "Bake for 8-10 minutes or until a toothpick inserted into the donut comes out clean.",
        "7": "Remove from the oven and allow to cool for about 5 minutes in the pan. Remove donuts from the pan and transfer to a wire rack to cool.",
        "8": "In a separate bowl, mix together the powdered sugar, cocoa powder, vanilla, and milk. If the glaze is too thick, slowly add one tablespoon of milk at a time until it has reached your desired consistency.",
        "9": "Dip the tops of the donuts into the glaze and transfer back to the wire rack to cool and allow the glaze to harden. Top with sprinkles if desired."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235277/cakery/medium_bakedchocolatedonuts_42b3efbf23.webp",
      "category": "Donuts",
      "time": "25min",
      "servings": 8
    },
    {
      "id": 16,
      "title": "Cream Filled Doughnuts",
      "ingredients": {
        "1": "1 1/2 cups milk",
        "2": "1/2 cup granulated sugar",
        "3": "1 1/2 teaspoons salt",
        "4": "1/4 cup (2-ounces) unsalted butter, more for the bowl ",
        "5": "1/2 cup warm water",
        "6": "2 envelopes (4 1/2 teaspoons) active dry yeast",
        "7": "2 large eggs, beaten",
        "8": "6 1/2 cups sifted all-purpose flour, or as needed, divided",
        "9": "1 teaspoon finely grated lemon zest",
        "10": "Canola oil, or vegetable oil, for frying",
        "11": "Confectioners' sugar, for garnish, optional",
        "12": "4 cups cold milk",
        "13": "2 (3.4-ounce) packages instant pudding mix"
      },
      "instructions": {
        "1": "Scald 1 1/2 cups milk in a medium saucepan. Stir in the granulated sugar, salt, and butter. Remove from heat and cool to lukewarm.",
        "2": "Add the warm water to a large mixing bowl. Sprinkle the yeast over the water and stir the mixture gently until the yeast dissolves.",
        "3": "Combine the cooled milk-butter mixture with the yeast. Add the eggs and half the flour and mix until smooth.",
        "4": "Stir in the lemon zest and enough of remaining flour to make a soft dough; mix well (you may not need all the flour).",
        "5": "Turn the dough out onto the lightly floured surface and knead for about 8 minutes, or until smooth and elastic. Alternatively, use a stand mixer fitted with the paddle attachment on medium speed for about 4 minutes.",
        "6": "Place in a lightly buttered bowl, turning to coat all sides. Cover tightly and let the dough rise in a warm place, free from drafts, for about 45 minutes, until doubled in bulk.",
        "7": "Punch the dough down and turn it out onto the lightly floured surface. Divide it in half. Cover the unused half to prevent it from drying out.",
        "8": "Roll out one half into a large round, about 1/2 inch thick.",
        "9": "Cut doughnut rounds with a floured 3-inch circle or biscuit cutter.",
        "10": "Place the doughnuts on a baking sheet. Repeat with the remaining half of the dough. Combine the dough scraps and continue cutting doughnuts until the dough is used. Cover with a lightweight kitchen towel and let rise in a warm place, free from draft, until doubled in size, about 30 minutes.",
        "11": "Heat the oil in a deep, heavy, large pan until it reaches 365 F. Fry the doughnuts in batches (so not to overcrowd the pan) until golden brown and cooked throughout, turning once to brown both sides, about 2 minutes per side.",
        "12": "Drain on paper towels and repeat with the remaining dough. Let the doughnuts thoroughly cool before filling.",
        "13": "Meanwhile, make the filling. Pour the cold milk into a deep bowl. Add the pudding mix and whisk until well blended and thick, about 1 minute. Refrigerate, covered, for at least 5 to 10 minutes.",
        "14": "Spoon the pudding into a pastry bag with a wide nozzle. Poke a hole in the side of each doughnut. Pipe the pudding into the cooled doughnuts.",
        "15": "Sift confectioners' sugar over the filled doughnuts, if using. Keep the doughnuts refrigerated until ready to serve. Store leftovers covered in the refrigerator."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235287/cakery/small_cream_filled_doughnuts_ef09829015.webp",
      "category": "Donuts",
      "time": "2hrs 37min",
      "servings": 36
    },
    {
      "id": 17,
      "title": "Pear & berry pie",
      "ingredients": {
        "1": "plain flour for dusting",
        "2": "300g sweet shortcrust pastry",
        "3": "freshly grated nutmeg",
        "4": "1 egg beaten",
        "5": "1 tbsp demerara sugar",
        "6": "custard cream or ice cream to serve",
        "7": "75g white caster sugar",
        "8": "1 lemon pared",
        "9": "5 cardamom pods",
        "10": "½ nutmeg",
        "11": "1 cinnamon stick",
        "12": "3 small pears peeled cored and halved",
        "13": "3-4 small pears peeled cored and chopped",
        "14": "75g white caster sugar",
        "15": "2 tsp cornflour",
        "16": "2 tbsp ground almonds",
        "17": "150g berries"
      },
      "instructions": {
        "1": "To make the poached pears, put the sugar in a big saucepan with the lemon peel, cardamom pods, nutmeg, cinnamon and 1 litre water. Bring to a gentle simmer. Lower the pear halves into the liquid and place a circle of baking parchment on top, so they cook through properly. Leave over a medium heat, so that a few bubbles break the surface every now and then, and cook for 15 mins. Allow to cool in the liquid. Can be chilled overnight if making ahead.",
        "2": "Heat oven to 180C/160C fan/gas 4. Dust the work surface with a little plain flour. Roll out the pastry so it’s big enough to line a 20-23cm frying pan, pie dish or shallow baking tin. Grate a little nutmeg over the surface, then gently roll again to help it stick. Lift over your dish, press into the corners, then trim the edges. You can give it a pretty crimped edge, if you like, then wrap the off-cuts in cling film and keep in the fridge until needed. Scrunch up a sheet of baking parchment, unfold, and lay it over the pastry. Fill with baking beans and bake for 15 mins. Remove the beans and parchment, brush with some of the beaten egg and return to the oven for another 5 mins.",
        "3": "Meanwhile, make the filling. Cook the remaining pears and sugar in a small pan until the pears are soft enough to squash with the back of a spoon. Drain off 3 tbsp of the poaching liquid and mix this with the cornflour, then pour back into the pears and continue cooking and squashing for another minute or so, until the filling has thickened.",
        "4": "Sprinkle the ground almonds over the pastry case, then add the squashed pear mixture and scatter over the berries. Remove the poached pears from their liquid and blot them on some kitchen paper. Arrange them face-up among the pear mixture and berries. Using a mini pastry cutter, cut little shapes from the leftover pastry, then arrange them on top. Brush the pastry pieces with beaten egg and sprinkle with the demerara sugar. Bake for 45-50 mins until the pastry is golden and berry juice is bubbling. Cool for 10-15 mins before serving with custard, cream or ice cream, if you like."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235289/cakery/pear_berry_pie_1d671beb7b.webp",
      "category": "Pies",
      "time": "2hrs",
      "servings": 5
    },
    {
      "id": 18,
      "title": "Banoffee pie",
      "ingredients": {
        "1": "225g digestive biscuits",
        "2": "150g butter , melted",
        "3": "397g can caramel or 400g dulce de leche",
        "4": "3 small bananas , sliced",
        "5": "300ml double cream",
        "6": "1 tbsp icing sugar",
        "7": "1 square dark chocolate (optional)"
      },
      "instructions": {
        "1": "Crush the digestive biscuits, either by hand using a wooden spoon, or in a food processor, until you get fine crumbs, tip into a bowl. Mix the crushed biscuits with the melted butter until fully combined. Tip the mixture into a 23cm loose bottomed fluted tart tin and cover the tin, including the sides, with the biscuit in an even layer. Push down with the back of a spoon to smooth the surface and chill for 1 hr, or overnight.",
        "2": "Beat the caramel to loosen and spoon it over the bottom of the biscuit base. Spread it out evenly using the back of a spoon or palette knife. Gently push the chopped banana into the top of the caramel until the base is covered. Put in the fridge.",
        "3": "Whip the cream with the icing sugar until billowy and thick. Take the pie out of the fridge and spoon the whipped cream on top of the bananas. Grate the dark chocolate over the cream, if you like, and serve."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235278/cakery/small_banoffee_pie_d8b4d2e521.webp",
      "category": "Pies",
      "time": "35min",
      "servings": 9
    },
    {
      "id": 19,
      "title": "Sweet potatoe pie",
      "ingredients": {
        "1": "1 (1 pound) sweet potato, with skin",
        "2": "½ cup butter, softened",
        "3": "1 cup white sugar",
        "4": "½ cup milk",
        "5": "2 large eggs",
        "6": "½ teaspoon ground nutmeg",
        "7": "½ teaspoon ground cinnamon",
        "8": "1 teaspoon vanilla extract",
        "9": "1 (9 inch) unbaked pie crust"
      },
      "instructions": {
        "1": "Place whole sweet potato in pot and cover with water; bring to a boil. Boil until tender when pierced with a fork, 40 to 50 minutes.",
        "2": "Preheat the oven to 175°C",
        "3": "Remove sweet potato from the pot and run under cold water. Remove and discard skin.",
        "4": "Break sweet potato flesh apart and place in a bowl. Add butter and mix with an electric mixer until well combined. Add sugar, milk, eggs, nutmeg, cinnamon, and vanilla; beat on medium speed until mixture is smooth. Pour filling into unbaked pie crust.",
        "5": "Bake in the preheated oven until a knife inserted in the center comes out clean, 55 to 60 minutes.",
        "6": "Remove from the oven and let cool before serving."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235295/cakery/small_Sweet_Potato_Pie_5fbbe83a8e.webp",
      "category": "Pies",
      "time": "1hr 55min",
      "servings": 9
    },
    {
      "id": 20,
      "title": "Apple pie",
      "ingredients": {
        "1": "6 cups thinly sliced apples",
        "2": "¾ cup white sugar",
        "3": "1 tablespoon butter ",
        "4": "1 teaspoon ground cinnamon",
        "5": "1 recipe pastry for a 9-inch double-crust pie "
      },
      "instructions": {
        "1": "Prepare your pastry for a two crust pie. Wipe, quarter, core, peel, and slice apples; measure to 6 cups.",
        "2": "Combine sugar and cinnamon. The amount of sugar used depends on how tart your apples are.",
        "3": "Arrange apples in layers in pastry lined pie plate. Sprinkle each layer with sugar and cinnamon. Dot top layer with small pieces of butter or margarine. Cover with top crust.",
        "4": "Place on lowest rack in oven preheated to 450 degrees F (230 degrees C). Bake for 10 minutes, then reduce oven temperature to 350 degrees F (175 degrees C). Bake for 30 to 35 minutes longer. Serve warm or cold."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235276/cakery/small_apple_pie_e833eb1558.webp",
      "category": "Pies",
      "time": "1hr",
      "servings": 8
    },
    {
      "id": 21,
      "title": "Vanilla Coconut Cupcakes",
      "ingredients": {
        "1": "150g unsalted butter, cut into cubes",
        "2": "115g caster sugar",
        "3": "2 teaspoons natural vanilla extract",
        "4": "2 eggs",
        "5": "185g plain flour",
        "6": "1 teaspoon baking powder",
        "7": "45g desiccated coconut",
        "8": "125ml milk"
      },
      "instructions": {
        "1": "Preheat the oven to 180°C. Line twelve 125ml muffin holes with paper cases.",
        "2": "Put the butter, sugar and vanillaextract in a bowl and beat with electric beaters for 2-3 minutes, or until thick and creamy. Add the eggs one at a time, and beat in each well combined.",
        "3": "Sift together the flour and baking powder. Use a metal spoon to stir in the sifted flour and baking powder in two lots. Stir in the desiccated coconut and the milk.",
        "4": "Put spoonfuls evenly into the paper cases. Bake for 18 - 20 minutes, or until firm and golden brown. Cool on a wire rack.",
        "5": "To make the vanill glace icing, spread the flaked coconut on a tray and lightly toast for 2 - 3 minutes in the oven. Put the butter in a small bowl and pour over 2 teaspoons of hot water to soften the butter. Add the vanill extract. Put the icing sugar in a bowl, add the butter mixture and mix together until smooth adding a little more water if necessary to make a spreading consistency.",
        "6": "Use a small spatula to spread the cooled cakes with the icing and dip each into the coconut flakes. Set aside to firm the icing."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235286/cakery/small_Coconut_Cupcakes_fbf59756a6.webp",
      "category": "Cupcakes",
      "time": "40min",
      "servings": 12
    },
    {
      "id": 22,
      "title": "Orange and almond cake",
      "ingredients": {
        "1": "2 large navel oranges",
        "2": "6 eggs",
        "3": "1 tablespoon orange blossom water or orange liqueur",
        "4": "250g caster sugar",
        "5": "300g ground almonds",
        "6": "1 teaspoon baking powder",
        "7": "3 navel oranges, peeled, pith and sinew removed, thinly sliced to garnish",
        "8": "500ml fresh orange juice strained",
        "9": "185g caster sugar",
        "10": "60ml sauternes"
      },
      "instructions": {
        "1": "Grease and flour a 23cm spring-form cake tin, tipping out any excess flour.",
        "2": "Put the whole oranges into a saucepan full of water. Boil for 2 hours topping up with water as needed. Remove the oranges, quater them and process in a food processor until smooth. Cool thoroughly. Preheat the oven to 180C.",
        "3": "Place the egg yolks, orange blossom water and caster sugar in a large bowl and beat until smooth, then stir in the orange puree and mix well.",
        "4": "Whisk the egg whites in a dry bowl until firm peaks form. Add the ground almonds and baking powder to the orange mixture, stir well then fold in the egg whites.",
        "5": "Pour into the cake tin and bake for 1 hour, or until firm, cover with foil if it begins to over-brown. Cool in the tin, then transfer to a serving plate.",
        "6": "To make the syrup, put the orange juice, sugar and Sauternes in a saucepan over medium heat and stir until the sugar is dissolved. Reduce the heat and simmer for 20 minutes, or until reduced by half and slightly syrupy, skimmingoff any scum.",
        "7": "Cut the cake into wedges, garnish with orange slices and drizzle with the syrup. Delicious served with cream."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235289/cakery/small_orange_almond_cake_6d1ddaefab.webp",
      "category": "Cake",
      "time": "3hrs 25min",
      "servings": 7
    },
    {
      "id": 23,
      "title": "Chocolate cherry cake",
      "ingredients": {
        "1": "200g dark chocolate, chopped",
        "2": "250g unsalted butter, chopped",
        "3": "230g firmly packed soft brown sugar",
        "4": "1 teaspoon natural vanilla extract",
        "5": "155g self-raising flour",
        "6": "45g desiccated coconut",
        "7": "2 eggs",
        "8": "180g pitted sour cherries, drained"
      },
      "instructions": {
        "1": "Preheat the oven to 160°C. Grease a 23cm round cake tin and line the base with baking paper.",
        "2": "Put the chocolate, butter, sugar and vanilla in a heatproof bowl and melt over a saucepan of simmering water, stirring occasionally, until the chocolate has melted. Make sure the base of the bowl doesn't touch the water. Sit the bowl in a sink of cold water to cool.",
        "3": "Combine the flour and coconut in a food processor. Add the chocolate mixture and eggs and process in short bursts until just combined. Add the cherries and process in one longish burst to just chop.",
        "4": "Pour the mixture into the tin and bake for 1 hour 10 minutes, or until a skewer comes out clean when inserted into the centre of the cake.",
        "5": "Leave in the tin for 15 miutes before carefully turning out onto a wire rack to cool. If desired dust with icing sugar and decorate with fresh cherries just before serving."
      },
      "img": "https://res.cloudinary.com/dop6sakq2/image/upload/v1649235279/cakery/small_chocolate_cherry_cake_16efd64436.webp",
      "category": "Cake",
      "time": "1hr 25min",
      "servings": 8
    },
    {
      "id": 24,
      "title": "Key Lime Pie",
      "ingredients": {
        "1": "375g ready-made or home-made sweet shortcrust pastry",
        "2": "4 egg yolks",
        "3": "395g tinned condensed milk",
        "4": "125ml lime juice",
        "5": "2 teaspoons grated lime zest",
        "6": "lime slices, to garnish",
        "7": "icing sugar, to dust",
        "8": "whipped cream, to serve"
      },
      "instructions": {
        "1": "Preheat the oven to 160°C. Grease a 23cm loose-bottomed flan tin.",
        "2": "Roll the dough out between two sheets of baking paper until it is large enough to fit into the pie tin. Remove the top sheet of paper and invert the pastry into the tin. Use a small ball of pastry to help press the pastry into the tin, allowing any excess to hang over the sides. Use a small sharp knife to trim away any extra pastry.",
        "3": "Line the pastry shell with a piece of crumpled baking paper that is large enough to cover the base and side of the tin and pour in some baking beads or rice.",
        "4": "Bake for 10 minutes, remove the paper and beads and return the pastry to the oven for another 4-5 minutes, or until the base is dry. Leave to cool.",
        "5": "Beat the egg yolks, condensed milk, lime juice and zest in a large bowl using electric beaters for 2 minutes, or until well combined. Pour into the pie shell and smooth the surface.",
        "6": "Bake for 20-25 minutes or until set. Allow the pie to cool, then refrigerate for 2 hours, or until well chilled. Garnish with lime slices, dust with sifted icing sugar and serve with whipped cream."
      },
      "img": "https://www.livewellbakeoften.com/wp-content/uploads/2021/05/Key-Lime-Pie-NEW-7s.jpg",
      "category": "Pies",
      "time": "40min",
      "servings": 7
    },
    {
      "id": 25,
      "title": "Blueberry Crumble Cake",
      "ingredients": {
        "1": "125g plain flour",
        "2": "110g wholemeal plain flour",
        "3": "225g caster sugar",
        "4": "2 ½ teaspoons baking powder",
        "5": "½ teaspoon ground cinnamon",
        "6": "150g blueberries",
        "7": "1 egg at room temperature",
        "8": "185ml milk",
        "9": "80ml oil",
        "10": "1 teaspoon natural vanilla extract",
        "11": "zest of 1 lemon finely grated",
        "12": "thick cream to serve",
        "13": "60g pecans chopped",
        "14": "55g soft brown sugar",
        "15": "30g plain flour",
        "16": "150g blueberries",
        "17": "2 tablespoons oil"
      },
      "instructions": {
        "1": "Preheat the oven to 190°C. Grease a 20cm spring-form cake tin.",
        "2": "Sift the flours, sugar, baking powder and cinnamon into a large bowl. Retrn the husks collected in the sieve to the bowl. Toss the blueberries through the flour mixture.",
        "3": "Whisk together the egg, milk, oil, vanilla extract and lemon zest. Pour onto the dry ingredients and stir to combine. Pour the mixture into the prepared tin.",
        "4": "To make the topping, combine the pecans, brown sugar, flour and blueberries in a bowl and sprinkle evenly over the cake. Drizzle the oil over the topping.",
        "5": "Bake for 50-55 minutes, or until a skewer comes out clean when inserted into the center of the cake Serve the cake warm with a dollop of thick cream."
      },
      "img": "https://www.onceuponachef.com/images/2017/08/blueberry-coffee-cake.jpg",
      "category": "Cake",
      "time": "55min",
      "servings": 9
    },
    {
      "id": 26,
      "title": "Double Chocolate Brownies",
      "ingredients": {
        "1": "80g butter",
        "2": "40g unsweentened cocoa powder",
        "3": "145g caster sugar",
        "4": "2 eggs",
        "5": "60g plain flour",
        "6": "½ teaspoon baking powder",
        "7": "100g chocolate chips"
      },
      "instructions": {
        "1": "Preheat the oven to 180°C. Grease a 20cm x 30cm shallow baking tin and line with baking paper.",
        "2": "Melt the butter in a saucepan, then stir in the cocoa and sugar. Add the eggs, stirring to combine.",
        "3": "Sift the flour, baking powder and a pinch of salt into the saucepan then stir to combine. Add the chocolate chips and stir to combine.",
        "4": "Pour the mixture into the tin and bake for 30 minutes, or until a skewer inserted in the center comes out clean. Remember though, the chocolate chips may have melted and if your skewer hits one of those, it might look as if the mixture is still wet.",
        "5": "Allow to cool in the tin, then remove and cut into brownie pieces."
      },
      "img": "https://i.ytimg.com/vi/TrsTZv8sA-o/maxresdefault.jpg",
      "category": "Brownies",
      "time": "30min",
      "servings": 12
    }
  ]
}
